Revit 2027 API
PerformanceAdviser.DeleteRule Method
 Deletes a performance adviser rule from the list of rules.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void DeleteRule(
	PerformanceAdviserRuleId id
)
Public Sub DeleteRule (
	id As PerformanceAdviserRuleId
)
public:
void DeleteRule(
	PerformanceAdviserRuleId^ id
)
member DeleteRule :
        id : PerformanceAdviserRuleId -> unit
Parameters
id PerformanceAdviserRuleId
 An id of the rule to be deleted from the list of rules.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
PerformanceAdviser Class
Autodesk.Revit.DB Namespace